zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_ENETC_BASE.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_ENETC_BASE
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_ENETC_BASE_H_)  /* Check if memory map has not been already included */
#define S32K566_ENETC_BASE_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ENETC_BASE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_BASE_Peripheral_Access_Layer ENETC_BASE Peripheral Access Layer
 * @{
 */

/** ENETC_BASE - Size of Registers Arrays */
#define ENETC_BASE_PARCEACR_COUNT                 4u
#define ENETC_BASE_PICDRADCR_COUNT                4u
#define ENETC_BASE_TC_TBS_NUM_COUNT               8u
#define ENETC_BASE_NUM_SMHRBDRMR_COUNT            15u
#define ENETC_BASE_NUM_SI_COUNT                   6u

/** ENETC_BASE - Register Layout Typedef */
typedef struct ENETC_BASE_Struct {
  __I  uint32_t ECAPR0;                            /**< ENETC capability register 0, offset: 0x0 */
  __I  uint32_t ECAPR1;                            /**< ENETC capability register 1, offset: 0x4 */
  __I  uint32_t ECAPR2;                            /**< ENETC capability register 2, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t PMR;                               /**< Port mode register, offset: 0x10 */
  uint8_t RESERVED_1[108];
  __IO uint32_t PONVLANR;                          /**< Port outer native VLAN register, offset: 0x80 */
  __IO uint32_t PINVLANR;                          /**< Port inner native VLAN register, offset: 0x84 */
  __IO uint32_t PVCLCTR;                           /**< Port VLAN classification control register, offset: 0x88 */
  uint8_t RESERVED_2[16];
  __IO uint32_t PARCSCR;                           /**< Parser checksum configuration register, offset: 0x9C */
  __IO uint32_t PARCECR[ENETC_BASE_PARCEACR_COUNT]; /**< Parser custom EtherType 0 configuration register..Parser custom EtherType 3 configuration register, array offset: 0xA0, array step: 0x4 */
  uint8_t RESERVED_3[88];
  __IO uint32_t PPAUONTR;                          /**< Port pause ON threshold register, offset: 0x108 */
  __IO uint32_t PPAUOFFTR;                         /**< Port pause OFF threshold register, offset: 0x10C */
  uint8_t RESERVED_4[16];
  __I  uint32_t PRXMBER;                           /**< Port receive memory buffer entitlement register, offset: 0x120 */
  __I  uint32_t PRXMBLR;                           /**< Port receive memory buffer limit register, offset: 0x124 */
  __I  uint32_t PRXBCR;                            /**< Port receive buffer count register, offset: 0x128 */
  __I  uint32_t PRXBCHWMR;                         /**< Port receive buffer count high watermark register, offset: 0x12C */
  uint8_t RESERVED_5[16];
  struct ENETC_BASE_PICDRADCR {                    /* offset: 0x140, array step: 0x10 */
    __I  uint32_t PICDRDCR;                          /**< Port ingress congestion DR0 discard count register..Port ingress congestion DR3 discard count register, array offset: 0x140, array step: 0x10 */
    uint8_t RESERVED_0[4];
    __I  uint32_t PICDRDCRRR;                        /**< Port ingress congestion DR0 discard count read-reset register..Port ingress congestion DR3 discard count read-reset register, array offset: 0x148, array step: 0x10 */
    uint8_t RESERVED_1[4];
  } PICDRADCR[ENETC_BASE_PICDRADCR_COUNT];
  __IO uint32_t PICPDSR;                           /**< Port ingress congestion priority discard status register, offset: 0x180 */
  uint8_t RESERVED_6[124];
  __IO uint32_t PSIPMMR;                           /**< Port station interface promiscuous MAC mode register, offset: 0x200 */
  __IO uint32_t PSIPVMR;                           /**< Port station interface promiscuous VLAN mode register, offset: 0x204 */
  __I  uint32_t PBFDSIR;                           /**< Port broadcast frames dropped due to MAC filtering register, offset: 0x208 */
  __I  uint32_t PFDMSAPR;                          /**< Port frame drop MAC source address pruning register, offset: 0x20C */
  uint8_t RESERVED_7[112];
  __I  uint32_t PSIMAFCAPR;                        /**< Port station interface MAC address filtering capability register, offset: 0x280 */
  __I  uint32_t PUFDMFR;                           /**< Port unicast frames dropped due to MAC filtering register, offset: 0x284 */
  __I  uint32_t PMFDMFR;                           /**< Port multicast frames dropped due to MAC filtering register, offset: 0x288 */
  uint8_t RESERVED_8[52];
  __I  uint32_t PSIVLANFCAPR;                      /**< Port station interface VLAN filtering capability register, offset: 0x2C0 */
  __IO uint32_t PSIVLANFMR;                        /**< Port station interface VLAN filtering mode register, offset: 0x2C4 */
  uint8_t RESERVED_9[8];
  __I  uint32_t PUFDVFR;                           /**< Port unicast frames dropped VLAN filtering register, offset: 0x2D0 */
  __I  uint32_t PMFDVFR;                           /**< Port multicast frames dropped VLAN filtering register, offset: 0x2D4 */
  __I  uint32_t PBFDVFR;                           /**< Port broadcast frames dropped VLAN filtering register, offset: 0x2D8 */
  uint8_t RESERVED_10[36];
  __I  uint32_t PRFSCAPR;                          /**< Port RFS capability register, offset: 0x300 */
  uint8_t RESERVED_11[12];
  __IO uint32_t PRFSMR;                            /**< Port RFS mode register, offset: 0x310 */
  uint8_t RESERVED_12[92];
  __IO uint32_t IPV2ICMPMR0;                       /**< Receive IPV to ICM priority mapping register 0, offset: 0x370 */
  uint8_t RESERVED_13[12];
  __IO uint32_t PRIO2TCMR0;                        /**< Transmit priority to traffic class mapping register 0, offset: 0x380 */
  uint8_t RESERVED_14[4];
  __IO uint32_t TGSLR;                             /**< Time gate scheduling lookahead register, offset: 0x388 */
  uint8_t RESERVED_15[4];
  __IO uint32_t PTCTSDR[ENETC_BASE_TC_TBS_NUM_COUNT]; /**< Port traffic class a time specific departure register, array offset: 0x390, array step: 0x4 */
  uint8_t RESERVED_16[1104];
  __I  uint32_t SMCAPR;                            /**< Switch management capability register, offset: 0x800 */
  uint8_t RESERVED_17[124];
  __IO uint32_t SMHRBDRMR[ENETC_BASE_NUM_SMHRBDRMR_COUNT]; /**< Switch management host reason 1 receive BD ring mapping register..Switch management host reason 15 receive BD ring mapping register, array offset: 0x880, array step: 0x4 */
  uint8_t RESERVED_18[5956];
  struct ENETC_BASE_NUM_SI {                       /* offset: 0x2000, array step: 0x80 */
    __IO uint32_t PSIPMAR0;                          /**< Port station interface 0 primary MAC address register 0..Port station interface 5 primary MAC address register 0, array offset: 0x2000, array step: 0x80 */
    __IO uint32_t PSIPMAR1;                          /**< Port station interface 0 primary MAC address register 1..Port station interface 5 primary MAC address register 1, array offset: 0x2004, array step: 0x80 */
    __IO uint32_t PSIVLANR;                          /**< Port station interface 0 VLAN register..Port station interface 5 VLAN register, array offset: 0x2008, array step: 0x80 */
    uint8_t RESERVED_0[4];
    __IO uint32_t PSICFGR0;                          /**< Port station interface 0 configuration register 0..Port station interface 5 configuration register 0, array offset: 0x2010, array step: 0x80 */
    __IO uint32_t PSICFGR1;                          /**< Port station interface 1 configuration register 1..Port station interface 5 configuration register 1, array offset: 0x2014, array step: 0x80, valid indices: [1-5] */
    __IO uint32_t PSICFGR2;                          /**< Port station interface 0 configuration register 2..Port station interface 5 configuration register 2, array offset: 0x2018, array step: 0x80 */
    uint8_t RESERVED_1[20];
    __IO uint32_t PSIVMAFCFGR;                       /**< Port station interface 0 VSI MAC address filtering configuration register..Port station interface 5 VSI MAC address filtering configuration register, array offset: 0x2030, array step: 0x80 */
    __IO uint32_t PSIVLANFCFGR;                      /**< Port station interface 0 VLAN filtering configuration register..Port station interface 5 VLAN filtering configuration register, array offset: 0x2034, array step: 0x80 */
    uint8_t RESERVED_2[8];
    __I  uint32_t PSIRFSCFGR;                        /**< Port station interface 0 RFS configuration register..Port station interface 5 RFS configuration register, array offset: 0x2040, array step: 0x80 */
    uint8_t RESERVED_3[12];
    __IO uint32_t PSIUMHFR0;                         /**< Port station interface 0 unicast MAC hash filter register 0..Port station interface 5 unicast MAC hash filter register 0, array offset: 0x2050, array step: 0x80 */
    __IO uint32_t PSIUMHFR1;                         /**< Port station interface 0 unicast MAC hash filter register 1..Port station interface 5 unicast MAC hash filter register 1, array offset: 0x2054, array step: 0x80 */
    __IO uint32_t PSIMMHFR0;                         /**< Port station interface 0 multicast MAC hash filter register 0..Port station interface 5 multicast MAC hash filter register 0, array offset: 0x2058, array step: 0x80 */
    __IO uint32_t PSIMMHFR1;                         /**< Port station interface 0 multicast MAC hash filter register 1..Port station interface 5 multicast MAC hash filter register 1, array offset: 0x205C, array step: 0x80 */
    __IO uint32_t PSIVHFR0;                          /**< Port station interface 0 VLAN hash filter register 0..Port station interface 5 VLAN hash filter register 0, array offset: 0x2060, array step: 0x80 */
    __IO uint32_t PSIVHFR1;                          /**< Port station interface 0 VLAN hash filter register 1..Port station interface 5 VLAN hash filter register 1, array offset: 0x2064, array step: 0x80 */
    uint8_t RESERVED_4[24];
  } NUM_SI[ENETC_BASE_NUM_SI_COUNT];
} ENETC_BASE_Type, *ENETC_BASE_MemMapPtr;

/** Number of instances of the ENETC_BASE module. */
#define ENETC_BASE_INSTANCE_COUNT                (1u)

/* ENETC_BASE - Peripheral instance base addresses */
/** Peripheral NETC__ENETC0_BASE base address */
#define IP_NETC__ENETC0_BASE_BASE                (0x6D090000u)
/** Peripheral NETC__ENETC0_BASE base pointer */
#define IP_NETC__ENETC0_BASE                     ((ENETC_BASE_Type *)IP_NETC__ENETC0_BASE_BASE)
/** Array initializer of ENETC_BASE peripheral base addresses */
#define IP_ENETC_BASE_BASE_ADDRS                 { IP_NETC__ENETC0_BASE_BASE }
/** Array initializer of ENETC_BASE peripheral base pointers */
#define IP_ENETC_BASE_BASE_PTRS                  { IP_NETC__ENETC0_BASE }

/* ----------------------------------------------------------------------------
   -- ENETC_BASE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_BASE_Register_Masks ENETC_BASE Register Masks
 * @{
 */

/*! @name ECAPR0 - ENETC capability register 0 */
/*! @{ */

