zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_ECAPR0_RFS_MASK               (0x4U)
#define ENETC_BASE_ECAPR0_RFS_SHIFT              (2U)
#define ENETC_BASE_ECAPR0_RFS_WIDTH              (1U)
#define ENETC_BASE_ECAPR0_RFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_RFS_SHIFT)) & ENETC_BASE_ECAPR0_RFS_MASK)

#define ENETC_BASE_ECAPR0_ET_MASK                (0x10U)
#define ENETC_BASE_ECAPR0_ET_SHIFT               (4U)
#define ENETC_BASE_ECAPR0_ET_WIDTH               (1U)
#define ENETC_BASE_ECAPR0_ET(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_ET_SHIFT)) & ENETC_BASE_ECAPR0_ET_MASK)

#define ENETC_BASE_ECAPR0_TSD_MASK               (0x20U)
#define ENETC_BASE_ECAPR0_TSD_SHIFT              (5U)
#define ENETC_BASE_ECAPR0_TSD_WIDTH              (1U)
#define ENETC_BASE_ECAPR0_TSD(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_TSD_SHIFT)) & ENETC_BASE_ECAPR0_TSD_MASK)

#define ENETC_BASE_ECAPR0_RSS_MASK               (0x100U)
#define ENETC_BASE_ECAPR0_RSS_SHIFT              (8U)
#define ENETC_BASE_ECAPR0_RSS_WIDTH              (1U)
#define ENETC_BASE_ECAPR0_RSS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_RSS_SHIFT)) & ENETC_BASE_ECAPR0_RSS_MASK)

#define ENETC_BASE_ECAPR0_RSC_MASK               (0x200U)
#define ENETC_BASE_ECAPR0_RSC_SHIFT              (9U)
#define ENETC_BASE_ECAPR0_RSC_WIDTH              (1U)
#define ENETC_BASE_ECAPR0_RSC(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_RSC_SHIFT)) & ENETC_BASE_ECAPR0_RSC_MASK)

#define ENETC_BASE_ECAPR0_LSO_MASK               (0x400U)
#define ENETC_BASE_ECAPR0_LSO_SHIFT              (10U)
#define ENETC_BASE_ECAPR0_LSO_WIDTH              (1U)
#define ENETC_BASE_ECAPR0_LSO(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_LSO_SHIFT)) & ENETC_BASE_ECAPR0_LSO_MASK)

#define ENETC_BASE_ECAPR0_WO_MASK                (0x2000U)
#define ENETC_BASE_ECAPR0_WO_SHIFT               (13U)
#define ENETC_BASE_ECAPR0_WO_WIDTH               (1U)
#define ENETC_BASE_ECAPR0_WO(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_WO_SHIFT)) & ENETC_BASE_ECAPR0_WO_MASK)

#define ENETC_BASE_ECAPR0_FS_MASK                (0x10000U)
#define ENETC_BASE_ECAPR0_FS_SHIFT               (16U)
#define ENETC_BASE_ECAPR0_FS_WIDTH               (1U)
#define ENETC_BASE_ECAPR0_FS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_FS_SHIFT)) & ENETC_BASE_ECAPR0_FS_MASK)

#define ENETC_BASE_ECAPR0_FCSU_MASK              (0x100000U)
#define ENETC_BASE_ECAPR0_FCSU_SHIFT             (20U)
#define ENETC_BASE_ECAPR0_FCSU_WIDTH             (1U)
#define ENETC_BASE_ECAPR0_FCSU(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR0_FCSU_SHIFT)) & ENETC_BASE_ECAPR0_FCSU_MASK)
/*! @} */

/*! @name ECAPR1 - ENETC capability register 1 */
/*! @{ */

#define ENETC_BASE_ECAPR1_NUM_TCS_MASK           (0x70U)
#define ENETC_BASE_ECAPR1_NUM_TCS_SHIFT          (4U)
#define ENETC_BASE_ECAPR1_NUM_TCS_WIDTH          (3U)
#define ENETC_BASE_ECAPR1_NUM_TCS(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_TCS_SHIFT)) & ENETC_BASE_ECAPR1_NUM_TCS_MASK)

#define ENETC_BASE_ECAPR1_NUM_MCH_MASK           (0x300U)
#define ENETC_BASE_ECAPR1_NUM_MCH_SHIFT          (8U)
#define ENETC_BASE_ECAPR1_NUM_MCH_WIDTH          (2U)
#define ENETC_BASE_ECAPR1_NUM_MCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_MCH_SHIFT)) & ENETC_BASE_ECAPR1_NUM_MCH_MASK)

#define ENETC_BASE_ECAPR1_NUM_UCH_MASK           (0xC00U)
#define ENETC_BASE_ECAPR1_NUM_UCH_SHIFT          (10U)
#define ENETC_BASE_ECAPR1_NUM_UCH_WIDTH          (2U)
#define ENETC_BASE_ECAPR1_NUM_UCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_UCH_SHIFT)) & ENETC_BASE_ECAPR1_NUM_UCH_MASK)

#define ENETC_BASE_ECAPR1_NUM_MSIX_MASK          (0x7FF000U)
#define ENETC_BASE_ECAPR1_NUM_MSIX_SHIFT         (12U)
#define ENETC_BASE_ECAPR1_NUM_MSIX_WIDTH         (11U)
#define ENETC_BASE_ECAPR1_NUM_MSIX(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_MSIX_SHIFT)) & ENETC_BASE_ECAPR1_NUM_MSIX_MASK)

#define ENETC_BASE_ECAPR1_NUM_VSI_MASK           (0xF000000U)
#define ENETC_BASE_ECAPR1_NUM_VSI_SHIFT          (24U)
#define ENETC_BASE_ECAPR1_NUM_VSI_WIDTH          (4U)
#define ENETC_BASE_ECAPR1_NUM_VSI(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_VSI_SHIFT)) & ENETC_BASE_ECAPR1_NUM_VSI_MASK)

#define ENETC_BASE_ECAPR1_NUM_IPV_MASK           (0x80000000U)
#define ENETC_BASE_ECAPR1_NUM_IPV_SHIFT          (31U)
#define ENETC_BASE_ECAPR1_NUM_IPV_WIDTH          (1U)
#define ENETC_BASE_ECAPR1_NUM_IPV(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR1_NUM_IPV_SHIFT)) & ENETC_BASE_ECAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name ECAPR2 - ENETC capability register 2 */
/*! @{ */

#define ENETC_BASE_ECAPR2_NUM_TX_BDR_MASK        (0x3FFU)
#define ENETC_BASE_ECAPR2_NUM_TX_BDR_SHIFT       (0U)
#define ENETC_BASE_ECAPR2_NUM_TX_BDR_WIDTH       (10U)
#define ENETC_BASE_ECAPR2_NUM_TX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR2_NUM_TX_BDR_SHIFT)) & ENETC_BASE_ECAPR2_NUM_TX_BDR_MASK)

#define ENETC_BASE_ECAPR2_NUM_RX_BDR_MASK        (0x3FF0000U)
#define ENETC_BASE_ECAPR2_NUM_RX_BDR_SHIFT       (16U)
#define ENETC_BASE_ECAPR2_NUM_RX_BDR_WIDTH       (10U)
#define ENETC_BASE_ECAPR2_NUM_RX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_ECAPR2_NUM_RX_BDR_SHIFT)) & ENETC_BASE_ECAPR2_NUM_RX_BDR_MASK)
/*! @} */

/*! @name PMR - Port mode register */
/*! @{ */

#define ENETC_BASE_PMR_SI0EN_MASK                (0x10000U)
#define ENETC_BASE_PMR_SI0EN_SHIFT               (16U)
#define ENETC_BASE_PMR_SI0EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI0EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI0EN_SHIFT)) & ENETC_BASE_PMR_SI0EN_MASK)

#define ENETC_BASE_PMR_SI1EN_MASK                (0x20000U)
#define ENETC_BASE_PMR_SI1EN_SHIFT               (17U)
#define ENETC_BASE_PMR_SI1EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI1EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI1EN_SHIFT)) & ENETC_BASE_PMR_SI1EN_MASK)

#define ENETC_BASE_PMR_SI2EN_MASK                (0x40000U)
#define ENETC_BASE_PMR_SI2EN_SHIFT               (18U)
#define ENETC_BASE_PMR_SI2EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI2EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI2EN_SHIFT)) & ENETC_BASE_PMR_SI2EN_MASK)

