zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_PMR_SI3EN_MASK                (0x80000U)
#define ENETC_BASE_PMR_SI3EN_SHIFT               (19U)
#define ENETC_BASE_PMR_SI3EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI3EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI3EN_SHIFT)) & ENETC_BASE_PMR_SI3EN_MASK)

#define ENETC_BASE_PMR_SI4EN_MASK                (0x100000U)
#define ENETC_BASE_PMR_SI4EN_SHIFT               (20U)
#define ENETC_BASE_PMR_SI4EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI4EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI4EN_SHIFT)) & ENETC_BASE_PMR_SI4EN_MASK)

#define ENETC_BASE_PMR_SI5EN_MASK                (0x200000U)
#define ENETC_BASE_PMR_SI5EN_SHIFT               (21U)
#define ENETC_BASE_PMR_SI5EN_WIDTH               (1U)
#define ENETC_BASE_PMR_SI5EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMR_SI5EN_SHIFT)) & ENETC_BASE_PMR_SI5EN_MASK)
/*! @} */

/*! @name PONVLANR - Port outer native VLAN register */
/*! @{ */

#define ENETC_BASE_PONVLANR_VID_MASK             (0xFFFU)
#define ENETC_BASE_PONVLANR_VID_SHIFT            (0U)
#define ENETC_BASE_PONVLANR_VID_WIDTH            (12U)
#define ENETC_BASE_PONVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_VID_SHIFT)) & ENETC_BASE_PONVLANR_VID_MASK)

#define ENETC_BASE_PONVLANR_DEI_MASK             (0x1000U)
#define ENETC_BASE_PONVLANR_DEI_SHIFT            (12U)
#define ENETC_BASE_PONVLANR_DEI_WIDTH            (1U)
#define ENETC_BASE_PONVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_DEI_SHIFT)) & ENETC_BASE_PONVLANR_DEI_MASK)

#define ENETC_BASE_PONVLANR_PCP_MASK             (0xE000U)
#define ENETC_BASE_PONVLANR_PCP_SHIFT            (13U)
#define ENETC_BASE_PONVLANR_PCP_WIDTH            (3U)
#define ENETC_BASE_PONVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_PCP_SHIFT)) & ENETC_BASE_PONVLANR_PCP_MASK)

#define ENETC_BASE_PONVLANR_TPID_MASK            (0x30000U)
#define ENETC_BASE_PONVLANR_TPID_SHIFT           (16U)
#define ENETC_BASE_PONVLANR_TPID_WIDTH           (2U)
#define ENETC_BASE_PONVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_TPID_SHIFT)) & ENETC_BASE_PONVLANR_TPID_MASK)

#define ENETC_BASE_PONVLANR_PNE_MASK             (0x40000U)
#define ENETC_BASE_PONVLANR_PNE_SHIFT            (18U)
#define ENETC_BASE_PONVLANR_PNE_WIDTH            (1U)
#define ENETC_BASE_PONVLANR_PNE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_PNE_SHIFT)) & ENETC_BASE_PONVLANR_PNE_MASK)

#define ENETC_BASE_PONVLANR_VZE_MASK             (0x80000U)
#define ENETC_BASE_PONVLANR_VZE_SHIFT            (19U)
#define ENETC_BASE_PONVLANR_VZE_WIDTH            (1U)
#define ENETC_BASE_PONVLANR_VZE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PONVLANR_VZE_SHIFT)) & ENETC_BASE_PONVLANR_VZE_MASK)
/*! @} */

/*! @name PINVLANR - Port inner native VLAN register */
/*! @{ */

#define ENETC_BASE_PINVLANR_VID_MASK             (0xFFFU)
#define ENETC_BASE_PINVLANR_VID_SHIFT            (0U)
#define ENETC_BASE_PINVLANR_VID_WIDTH            (12U)
#define ENETC_BASE_PINVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_VID_SHIFT)) & ENETC_BASE_PINVLANR_VID_MASK)

#define ENETC_BASE_PINVLANR_DEI_MASK             (0x1000U)
#define ENETC_BASE_PINVLANR_DEI_SHIFT            (12U)
#define ENETC_BASE_PINVLANR_DEI_WIDTH            (1U)
#define ENETC_BASE_PINVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_DEI_SHIFT)) & ENETC_BASE_PINVLANR_DEI_MASK)

#define ENETC_BASE_PINVLANR_PCP_MASK             (0xE000U)
#define ENETC_BASE_PINVLANR_PCP_SHIFT            (13U)
#define ENETC_BASE_PINVLANR_PCP_WIDTH            (3U)
#define ENETC_BASE_PINVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_PCP_SHIFT)) & ENETC_BASE_PINVLANR_PCP_MASK)

#define ENETC_BASE_PINVLANR_TPID_MASK            (0x30000U)
#define ENETC_BASE_PINVLANR_TPID_SHIFT           (16U)
#define ENETC_BASE_PINVLANR_TPID_WIDTH           (2U)
#define ENETC_BASE_PINVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_TPID_SHIFT)) & ENETC_BASE_PINVLANR_TPID_MASK)

#define ENETC_BASE_PINVLANR_PNE_MASK             (0x40000U)
#define ENETC_BASE_PINVLANR_PNE_SHIFT            (18U)
#define ENETC_BASE_PINVLANR_PNE_WIDTH            (1U)
#define ENETC_BASE_PINVLANR_PNE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_PNE_SHIFT)) & ENETC_BASE_PINVLANR_PNE_MASK)

#define ENETC_BASE_PINVLANR_VZE_MASK             (0x80000U)
#define ENETC_BASE_PINVLANR_VZE_SHIFT            (19U)
#define ENETC_BASE_PINVLANR_VZE_WIDTH            (1U)
#define ENETC_BASE_PINVLANR_VZE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PINVLANR_VZE_SHIFT)) & ENETC_BASE_PINVLANR_VZE_MASK)
/*! @} */

/*! @name PVCLCTR - Port VLAN classification control register */
/*! @{ */

#define ENETC_BASE_PVCLCTR_OAI_MASK              (0x200U)
#define ENETC_BASE_PVCLCTR_OAI_SHIFT             (9U)
#define ENETC_BASE_PVCLCTR_OAI_WIDTH             (1U)
#define ENETC_BASE_PVCLCTR_OAI(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PVCLCTR_OAI_SHIFT)) & ENETC_BASE_PVCLCTR_OAI_MASK)
/*! @} */

/*! @name PARCSCR - Parser checksum configuration register */
/*! @{ */

#define ENETC_BASE_PARCSCR_L4CD_MASK             (0x1U)
#define ENETC_BASE_PARCSCR_L4CD_SHIFT            (0U)
#define ENETC_BASE_PARCSCR_L4CD_WIDTH            (1U)
#define ENETC_BASE_PARCSCR_L4CD(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PARCSCR_L4CD_SHIFT)) & ENETC_BASE_PARCSCR_L4CD_MASK)

#define ENETC_BASE_PARCSCR_L3CD_MASK             (0x2U)
#define ENETC_BASE_PARCSCR_L3CD_SHIFT            (1U)
#define ENETC_BASE_PARCSCR_L3CD_WIDTH            (1U)
#define ENETC_BASE_PARCSCR_L3CD(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PARCSCR_L3CD_SHIFT)) & ENETC_BASE_PARCSCR_L3CD_MASK)
/*! @} */

/*! @name PARCECR - Parser custom EtherType 0 configuration register..Parser custom EtherType 3 configuration register */
/*! @{ */

#define ENETC_BASE_PARCECR_CP_MASK               (0xFU)
#define ENETC_BASE_PARCECR_CP_SHIFT              (0U)
#define ENETC_BASE_PARCECR_CP_WIDTH              (4U)
#define ENETC_BASE_PARCECR_CP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PARCECR_CP_SHIFT)) & ENETC_BASE_PARCECR_CP_MASK)

