zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_PARCECR_EN_MASK               (0x20U)
#define ENETC_BASE_PARCECR_EN_SHIFT              (5U)
#define ENETC_BASE_PARCECR_EN_WIDTH              (1U)
#define ENETC_BASE_PARCECR_EN(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PARCECR_EN_SHIFT)) & ENETC_BASE_PARCECR_EN_MASK)

#define ENETC_BASE_PARCECR_ETYPE_MASK            (0xFFFF0000U)
#define ENETC_BASE_PARCECR_ETYPE_SHIFT           (16U)
#define ENETC_BASE_PARCECR_ETYPE_WIDTH           (16U)
#define ENETC_BASE_PARCECR_ETYPE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PARCECR_ETYPE_SHIFT)) & ENETC_BASE_PARCECR_ETYPE_MASK)
/*! @} */

/*! @name PPAUONTR - Port pause ON threshold register */
/*! @{ */

#define ENETC_BASE_PPAUONTR_THRESH_MASK          (0xFFFFFFU)
#define ENETC_BASE_PPAUONTR_THRESH_SHIFT         (0U)
#define ENETC_BASE_PPAUONTR_THRESH_WIDTH         (24U)
#define ENETC_BASE_PPAUONTR_THRESH(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PPAUONTR_THRESH_SHIFT)) & ENETC_BASE_PPAUONTR_THRESH_MASK)
/*! @} */

/*! @name PPAUOFFTR - Port pause OFF threshold register */
/*! @{ */

#define ENETC_BASE_PPAUOFFTR_THRESH_MASK         (0xFFFFFFU)
#define ENETC_BASE_PPAUOFFTR_THRESH_SHIFT        (0U)
#define ENETC_BASE_PPAUOFFTR_THRESH_WIDTH        (24U)
#define ENETC_BASE_PPAUOFFTR_THRESH(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PPAUOFFTR_THRESH_SHIFT)) & ENETC_BASE_PPAUOFFTR_THRESH_MASK)
/*! @} */

/*! @name PRXMBER - Port receive memory buffer entitlement register */
/*! @{ */

#define ENETC_BASE_PRXMBER_AMOUNT_MASK           (0xFFFFFFU)
#define ENETC_BASE_PRXMBER_AMOUNT_SHIFT          (0U)
#define ENETC_BASE_PRXMBER_AMOUNT_WIDTH          (24U)
#define ENETC_BASE_PRXMBER_AMOUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRXMBER_AMOUNT_SHIFT)) & ENETC_BASE_PRXMBER_AMOUNT_MASK)
/*! @} */

/*! @name PRXMBLR - Port receive memory buffer limit register */
/*! @{ */

#define ENETC_BASE_PRXMBLR_LIMIT_MASK            (0xFFFFFFU)
#define ENETC_BASE_PRXMBLR_LIMIT_SHIFT           (0U)
#define ENETC_BASE_PRXMBLR_LIMIT_WIDTH           (24U)
#define ENETC_BASE_PRXMBLR_LIMIT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRXMBLR_LIMIT_SHIFT)) & ENETC_BASE_PRXMBLR_LIMIT_MASK)
/*! @} */

/*! @name PRXBCR - Port receive buffer count register */
/*! @{ */

#define ENETC_BASE_PRXBCR_COUNT_MASK             (0xFFFFFFU)
#define ENETC_BASE_PRXBCR_COUNT_SHIFT            (0U)
#define ENETC_BASE_PRXBCR_COUNT_WIDTH            (24U)
#define ENETC_BASE_PRXBCR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRXBCR_COUNT_SHIFT)) & ENETC_BASE_PRXBCR_COUNT_MASK)
/*! @} */

/*! @name PRXBCHWMR - Port receive buffer count high watermark register */
/*! @{ */

#define ENETC_BASE_PRXBCHWMR_WATERMARK_MASK      (0xFFFFFFU)
#define ENETC_BASE_PRXBCHWMR_WATERMARK_SHIFT     (0U)
#define ENETC_BASE_PRXBCHWMR_WATERMARK_WIDTH     (24U)
#define ENETC_BASE_PRXBCHWMR_WATERMARK(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRXBCHWMR_WATERMARK_SHIFT)) & ENETC_BASE_PRXBCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name PICDRDCR - Port ingress congestion DR0 discard count register..Port ingress congestion DR3 discard count register */
/*! @{ */

#define ENETC_BASE_PICDRDCR_COUNT_MASK           (0xFFFFFFFFU)
#define ENETC_BASE_PICDRDCR_COUNT_SHIFT          (0U)
#define ENETC_BASE_PICDRDCR_COUNT_WIDTH          (32U)
#define ENETC_BASE_PICDRDCR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICDRDCR_COUNT_SHIFT)) & ENETC_BASE_PICDRDCR_COUNT_MASK)
/*! @} */

/*! @name PICDRDCRRR - Port ingress congestion DR0 discard count read-reset register..Port ingress congestion DR3 discard count read-reset register */
/*! @{ */

#define ENETC_BASE_PICDRDCRRR_COUNT_MASK         (0xFFFFFFFFU)
#define ENETC_BASE_PICDRDCRRR_COUNT_SHIFT        (0U)
#define ENETC_BASE_PICDRDCRRR_COUNT_WIDTH        (32U)
#define ENETC_BASE_PICDRDCRRR_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICDRDCRRR_COUNT_SHIFT)) & ENETC_BASE_PICDRDCRRR_COUNT_MASK)
/*! @} */

/*! @name PICPDSR - Port ingress congestion priority discard status register */
/*! @{ */

#define ENETC_BASE_PICPDSR_DR0_P0DS_MASK         (0x1U)
#define ENETC_BASE_PICPDSR_DR0_P0DS_SHIFT        (0U)
#define ENETC_BASE_PICPDSR_DR0_P0DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR0_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR0_P0DS_SHIFT)) & ENETC_BASE_PICPDSR_DR0_P0DS_MASK)

#define ENETC_BASE_PICPDSR_DR0_P1DS_MASK         (0x10U)
#define ENETC_BASE_PICPDSR_DR0_P1DS_SHIFT        (4U)
#define ENETC_BASE_PICPDSR_DR0_P1DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR0_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR0_P1DS_SHIFT)) & ENETC_BASE_PICPDSR_DR0_P1DS_MASK)

#define ENETC_BASE_PICPDSR_DR1_P0DS_MASK         (0x100U)
#define ENETC_BASE_PICPDSR_DR1_P0DS_SHIFT        (8U)
#define ENETC_BASE_PICPDSR_DR1_P0DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR1_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR1_P0DS_SHIFT)) & ENETC_BASE_PICPDSR_DR1_P0DS_MASK)

#define ENETC_BASE_PICPDSR_DR1_P1DS_MASK         (0x1000U)
#define ENETC_BASE_PICPDSR_DR1_P1DS_SHIFT        (12U)
#define ENETC_BASE_PICPDSR_DR1_P1DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR1_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR1_P1DS_SHIFT)) & ENETC_BASE_PICPDSR_DR1_P1DS_MASK)

#define ENETC_BASE_PICPDSR_DR2_P0DS_MASK         (0x10000U)
#define ENETC_BASE_PICPDSR_DR2_P0DS_SHIFT        (16U)
#define ENETC_BASE_PICPDSR_DR2_P0DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR2_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR2_P0DS_SHIFT)) & ENETC_BASE_PICPDSR_DR2_P0DS_MASK)

#define ENETC_BASE_PICPDSR_DR2_P1DS_MASK         (0x100000U)
#define ENETC_BASE_PICPDSR_DR2_P1DS_SHIFT        (20U)
#define ENETC_BASE_PICPDSR_DR2_P1DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR2_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR2_P1DS_SHIFT)) & ENETC_BASE_PICPDSR_DR2_P1DS_MASK)

#define ENETC_BASE_PICPDSR_DR3_P0DS_MASK         (0x1000000U)
#define ENETC_BASE_PICPDSR_DR3_P0DS_SHIFT        (24U)
#define ENETC_BASE_PICPDSR_DR3_P0DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR3_P0DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR3_P0DS_SHIFT)) & ENETC_BASE_PICPDSR_DR3_P0DS_MASK)

#define ENETC_BASE_PICPDSR_DR3_P1DS_MASK         (0x10000000U)
#define ENETC_BASE_PICPDSR_DR3_P1DS_SHIFT        (28U)
#define ENETC_BASE_PICPDSR_DR3_P1DS_WIDTH        (1U)
#define ENETC_BASE_PICPDSR_DR3_P1DS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PICPDSR_DR3_P1DS_SHIFT)) & ENETC_BASE_PICPDSR_DR3_P1DS_MASK)
/*! @} */

