zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
/*! @name PSIPMMR - Port station interface promiscuous MAC mode register */
/*! @{ */

#define ENETC_BASE_PSIPMMR_SI0_MAC_UP_MASK       (0x1U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_UP_SHIFT      (0U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI0_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI0_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI1_MAC_UP_MASK       (0x2U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_UP_SHIFT      (1U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI1_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI1_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI2_MAC_UP_MASK       (0x4U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_UP_SHIFT      (2U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI2_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI2_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI3_MAC_UP_MASK       (0x8U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_UP_SHIFT      (3U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI3_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI3_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI4_MAC_UP_MASK       (0x10U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_UP_SHIFT      (4U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI4_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI4_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI5_MAC_UP_MASK       (0x20U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_UP_SHIFT      (5U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_UP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_UP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI5_MAC_UP_SHIFT)) & ENETC_BASE_PSIPMMR_SI5_MAC_UP_MASK)

#define ENETC_BASE_PSIPMMR_SI0_MAC_MP_MASK       (0x10000U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_MP_SHIFT      (16U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI0_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI0_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI0_MAC_MP_MASK)

#define ENETC_BASE_PSIPMMR_SI1_MAC_MP_MASK       (0x20000U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_MP_SHIFT      (17U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI1_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI1_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI1_MAC_MP_MASK)

#define ENETC_BASE_PSIPMMR_SI2_MAC_MP_MASK       (0x40000U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_MP_SHIFT      (18U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI2_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI2_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI2_MAC_MP_MASK)

#define ENETC_BASE_PSIPMMR_SI3_MAC_MP_MASK       (0x80000U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_MP_SHIFT      (19U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI3_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI3_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI3_MAC_MP_MASK)

#define ENETC_BASE_PSIPMMR_SI4_MAC_MP_MASK       (0x100000U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_MP_SHIFT      (20U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI4_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI4_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI4_MAC_MP_MASK)

#define ENETC_BASE_PSIPMMR_SI5_MAC_MP_MASK       (0x200000U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_MP_SHIFT      (21U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_MP_WIDTH      (1U)
#define ENETC_BASE_PSIPMMR_SI5_MAC_MP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMMR_SI5_MAC_MP_SHIFT)) & ENETC_BASE_PSIPMMR_SI5_MAC_MP_MASK)
/*! @} */

/*! @name PSIPVMR - Port station interface promiscuous VLAN mode register */
/*! @{ */

#define ENETC_BASE_PSIPVMR_SI0_VLAN_P_MASK       (0x1U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_P_SHIFT      (0U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI0_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI0_VLAN_P_MASK)

#define ENETC_BASE_PSIPVMR_SI1_VLAN_P_MASK       (0x2U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_P_SHIFT      (1U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI1_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI1_VLAN_P_MASK)

#define ENETC_BASE_PSIPVMR_SI2_VLAN_P_MASK       (0x4U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_P_SHIFT      (2U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI2_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI2_VLAN_P_MASK)

#define ENETC_BASE_PSIPVMR_SI3_VLAN_P_MASK       (0x8U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_P_SHIFT      (3U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI3_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI3_VLAN_P_MASK)

#define ENETC_BASE_PSIPVMR_SI4_VLAN_P_MASK       (0x10U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_P_SHIFT      (4U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI4_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI4_VLAN_P_MASK)

#define ENETC_BASE_PSIPVMR_SI5_VLAN_P_MASK       (0x20U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_P_SHIFT      (5U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_P_WIDTH      (1U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_P(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI5_VLAN_P_SHIFT)) & ENETC_BASE_PSIPVMR_SI5_VLAN_P_MASK)

