zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_PSIPVMR_SI0_VLAN_UTA_MASK     (0x10000U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_UTA_SHIFT    (16U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI0_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI0_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI0_VLAN_UTA_MASK)

#define ENETC_BASE_PSIPVMR_SI1_VLAN_UTA_MASK     (0x20000U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_UTA_SHIFT    (17U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI1_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI1_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI1_VLAN_UTA_MASK)

#define ENETC_BASE_PSIPVMR_SI2_VLAN_UTA_MASK     (0x40000U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_UTA_SHIFT    (18U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI2_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI2_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI2_VLAN_UTA_MASK)

#define ENETC_BASE_PSIPVMR_SI3_VLAN_UTA_MASK     (0x80000U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_UTA_SHIFT    (19U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI3_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI3_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI3_VLAN_UTA_MASK)

#define ENETC_BASE_PSIPVMR_SI4_VLAN_UTA_MASK     (0x100000U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_UTA_SHIFT    (20U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI4_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI4_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI4_VLAN_UTA_MASK)

#define ENETC_BASE_PSIPVMR_SI5_VLAN_UTA_MASK     (0x200000U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_UTA_SHIFT    (21U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_UTA_WIDTH    (1U)
#define ENETC_BASE_PSIPVMR_SI5_VLAN_UTA(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPVMR_SI5_VLAN_UTA_SHIFT)) & ENETC_BASE_PSIPVMR_SI5_VLAN_UTA_MASK)
/*! @} */

/*! @name PBFDSIR - Port broadcast frames dropped due to MAC filtering register */
/*! @{ */

#define ENETC_BASE_PBFDSIR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PBFDSIR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PBFDSIR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PBFDSIR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PBFDSIR_FRAME_DROP_SHIFT)) & ENETC_BASE_PBFDSIR_FRAME_DROP_MASK)
/*! @} */

/*! @name PFDMSAPR - Port frame drop MAC source address pruning register */
/*! @{ */

#define ENETC_BASE_PFDMSAPR_FRAME_DROP_MASK      (0xFFFFFFFFU)
#define ENETC_BASE_PFDMSAPR_FRAME_DROP_SHIFT     (0U)
#define ENETC_BASE_PFDMSAPR_FRAME_DROP_WIDTH     (32U)
#define ENETC_BASE_PFDMSAPR_FRAME_DROP(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PFDMSAPR_FRAME_DROP_SHIFT)) & ENETC_BASE_PFDMSAPR_FRAME_DROP_MASK)
/*! @} */

/*! @name PSIMAFCAPR - Port station interface MAC address filtering capability register */
/*! @{ */

#define ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE_MASK  (0xFFFU)
#define ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE_SHIFT (0U)
#define ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE_WIDTH (12U)
#define ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE_SHIFT)) & ENETC_BASE_PSIMAFCAPR_NUM_MAC_AFTE_MASK)
/*! @} */

/*! @name PUFDMFR - Port unicast frames dropped due to MAC filtering register */
/*! @{ */

#define ENETC_BASE_PUFDMFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PUFDMFR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PUFDMFR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PUFDMFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PUFDMFR_FRAME_DROP_SHIFT)) & ENETC_BASE_PUFDMFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PMFDMFR - Port multicast frames dropped due to MAC filtering register */
/*! @{ */

#define ENETC_BASE_PMFDMFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PMFDMFR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PMFDMFR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PMFDMFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMFDMFR_FRAME_DROP_SHIFT)) & ENETC_BASE_PMFDMFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PSIVLANFCAPR - Port station interface VLAN filtering capability register */
/*! @{ */

#define ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE_MASK (0xFFFU)
#define ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE_SHIFT (0U)
#define ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE_WIDTH (12U)
#define ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE_SHIFT)) & ENETC_BASE_PSIVLANFCAPR_NUM_VLAN_FTE_MASK)
/*! @} */

/*! @name PSIVLANFMR - Port station interface VLAN filtering mode register */
/*! @{ */

#define ENETC_BASE_PSIVLANFMR_VS_MASK            (0x1U)
#define ENETC_BASE_PSIVLANFMR_VS_SHIFT           (0U)
#define ENETC_BASE_PSIVLANFMR_VS_WIDTH           (1U)
#define ENETC_BASE_PSIVLANFMR_VS(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANFMR_VS_SHIFT)) & ENETC_BASE_PSIVLANFMR_VS_MASK)
/*! @} */

/*! @name PUFDVFR - Port unicast frames dropped VLAN filtering register */
/*! @{ */

#define ENETC_BASE_PUFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PUFDVFR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PUFDVFR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PUFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PUFDVFR_FRAME_DROP_SHIFT)) & ENETC_BASE_PUFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PMFDVFR - Port multicast frames dropped VLAN filtering register */
/*! @{ */

#define ENETC_BASE_PMFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PMFDVFR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PMFDVFR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PMFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PMFDVFR_FRAME_DROP_SHIFT)) & ENETC_BASE_PMFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PBFDVFR - Port broadcast frames dropped VLAN filtering register */
/*! @{ */

#define ENETC_BASE_PBFDVFR_FRAME_DROP_MASK       (0xFFFFFFFFU)
#define ENETC_BASE_PBFDVFR_FRAME_DROP_SHIFT      (0U)
#define ENETC_BASE_PBFDVFR_FRAME_DROP_WIDTH      (32U)
#define ENETC_BASE_PBFDVFR_FRAME_DROP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PBFDVFR_FRAME_DROP_SHIFT)) & ENETC_BASE_PBFDVFR_FRAME_DROP_MASK)
/*! @} */

/*! @name PRFSCAPR - Port RFS capability register */
/*! @{ */

#define ENETC_BASE_PRFSCAPR_NUM_RFS_MASK         (0xFFU)
#define ENETC_BASE_PRFSCAPR_NUM_RFS_SHIFT        (0U)
#define ENETC_BASE_PRFSCAPR_NUM_RFS_WIDTH        (8U)
#define ENETC_BASE_PRFSCAPR_NUM_RFS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRFSCAPR_NUM_RFS_SHIFT)) & ENETC_BASE_PRFSCAPR_NUM_RFS_MASK)
/*! @} */

/*! @name PRFSMR - Port RFS mode register */
/*! @{ */

#define ENETC_BASE_PRFSMR_RFSE_MASK              (0x80000000U)
#define ENETC_BASE_PRFSMR_RFSE_SHIFT             (31U)
#define ENETC_BASE_PRFSMR_RFSE_WIDTH             (1U)
#define ENETC_BASE_PRFSMR_RFSE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRFSMR_RFSE_SHIFT)) & ENETC_BASE_PRFSMR_RFSE_MASK)
/*! @} */

/*! @name IPV2ICMPMR0 - Receive IPV to ICM priority mapping register 0 */
/*! @{ */

