zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_IPV2ICMPMR0_IPV0ICM_MASK      (0x1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV0ICM_SHIFT     (0U)
#define ENETC_BASE_IPV2ICMPMR0_IPV0ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV0ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV0ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV0ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV1ICM_MASK      (0x10U)
#define ENETC_BASE_IPV2ICMPMR0_IPV1ICM_SHIFT     (4U)
#define ENETC_BASE_IPV2ICMPMR0_IPV1ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV1ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV1ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV1ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV2ICM_MASK      (0x100U)
#define ENETC_BASE_IPV2ICMPMR0_IPV2ICM_SHIFT     (8U)
#define ENETC_BASE_IPV2ICMPMR0_IPV2ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV2ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV2ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV2ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV3ICM_MASK      (0x1000U)
#define ENETC_BASE_IPV2ICMPMR0_IPV3ICM_SHIFT     (12U)
#define ENETC_BASE_IPV2ICMPMR0_IPV3ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV3ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV3ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV3ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV4ICM_MASK      (0x10000U)
#define ENETC_BASE_IPV2ICMPMR0_IPV4ICM_SHIFT     (16U)
#define ENETC_BASE_IPV2ICMPMR0_IPV4ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV4ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV4ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV4ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV5ICM_MASK      (0x100000U)
#define ENETC_BASE_IPV2ICMPMR0_IPV5ICM_SHIFT     (20U)
#define ENETC_BASE_IPV2ICMPMR0_IPV5ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV5ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV5ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV5ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV6ICM_MASK      (0x1000000U)
#define ENETC_BASE_IPV2ICMPMR0_IPV6ICM_SHIFT     (24U)
#define ENETC_BASE_IPV2ICMPMR0_IPV6ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV6ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV6ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV6ICM_MASK)

#define ENETC_BASE_IPV2ICMPMR0_IPV7ICM_MASK      (0x10000000U)
#define ENETC_BASE_IPV2ICMPMR0_IPV7ICM_SHIFT     (28U)
#define ENETC_BASE_IPV2ICMPMR0_IPV7ICM_WIDTH     (1U)
#define ENETC_BASE_IPV2ICMPMR0_IPV7ICM(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_IPV2ICMPMR0_IPV7ICM_SHIFT)) & ENETC_BASE_IPV2ICMPMR0_IPV7ICM_MASK)
/*! @} */

/*! @name PRIO2TCMR0 - Transmit priority to traffic class mapping register 0 */
/*! @{ */

#define ENETC_BASE_PRIO2TCMR0_PRIO0TC_MASK       (0x7U)
#define ENETC_BASE_PRIO2TCMR0_PRIO0TC_SHIFT      (0U)
#define ENETC_BASE_PRIO2TCMR0_PRIO0TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO0TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO0TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO0TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO1TC_MASK       (0x70U)
#define ENETC_BASE_PRIO2TCMR0_PRIO1TC_SHIFT      (4U)
#define ENETC_BASE_PRIO2TCMR0_PRIO1TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO1TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO1TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO1TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO2TC_MASK       (0x700U)
#define ENETC_BASE_PRIO2TCMR0_PRIO2TC_SHIFT      (8U)
#define ENETC_BASE_PRIO2TCMR0_PRIO2TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO2TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO2TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO2TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO3TC_MASK       (0x7000U)
#define ENETC_BASE_PRIO2TCMR0_PRIO3TC_SHIFT      (12U)
#define ENETC_BASE_PRIO2TCMR0_PRIO3TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO3TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO3TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO3TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO4TC_MASK       (0x70000U)
#define ENETC_BASE_PRIO2TCMR0_PRIO4TC_SHIFT      (16U)
#define ENETC_BASE_PRIO2TCMR0_PRIO4TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO4TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO4TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO4TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO5TC_MASK       (0x700000U)
#define ENETC_BASE_PRIO2TCMR0_PRIO5TC_SHIFT      (20U)
#define ENETC_BASE_PRIO2TCMR0_PRIO5TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO5TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO5TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO5TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO6TC_MASK       (0x7000000U)
#define ENETC_BASE_PRIO2TCMR0_PRIO6TC_SHIFT      (24U)
#define ENETC_BASE_PRIO2TCMR0_PRIO6TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO6TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO6TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO6TC_MASK)

#define ENETC_BASE_PRIO2TCMR0_PRIO7TC_MASK       (0x70000000U)
#define ENETC_BASE_PRIO2TCMR0_PRIO7TC_SHIFT      (28U)
#define ENETC_BASE_PRIO2TCMR0_PRIO7TC_WIDTH      (3U)
#define ENETC_BASE_PRIO2TCMR0_PRIO7TC(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PRIO2TCMR0_PRIO7TC_SHIFT)) & ENETC_BASE_PRIO2TCMR0_PRIO7TC_MASK)
/*! @} */

/*! @name TGSLR - Time gate scheduling lookahead register */
/*! @{ */

#define ENETC_BASE_TGSLR_MIN_LOOKAHEAD_MASK      (0xFFFFFU)
#define ENETC_BASE_TGSLR_MIN_LOOKAHEAD_SHIFT     (0U)
#define ENETC_BASE_TGSLR_MIN_LOOKAHEAD_WIDTH     (20U)
#define ENETC_BASE_TGSLR_MIN_LOOKAHEAD(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_TGSLR_MIN_LOOKAHEAD_SHIFT)) & ENETC_BASE_TGSLR_MIN_LOOKAHEAD_MASK)
/*! @} */

/*! @name PTCTSDR - Port traffic class a time specific departure register */
/*! @{ */

#define ENETC_BASE_PTCTSDR_TSDE_MASK             (0x80000000U)
#define ENETC_BASE_PTCTSDR_TSDE_SHIFT            (31U)
#define ENETC_BASE_PTCTSDR_TSDE_WIDTH            (1U)
#define ENETC_BASE_PTCTSDR_TSDE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PTCTSDR_TSDE_SHIFT)) & ENETC_BASE_PTCTSDR_TSDE_MASK)
/*! @} */

