zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
/*! @name SMCAPR - Switch management capability register */
/*! @{ */

#define ENETC_BASE_SMCAPR_SM_MASK                (0x1U)
#define ENETC_BASE_SMCAPR_SM_SHIFT               (0U)
#define ENETC_BASE_SMCAPR_SM_WIDTH               (1U)
#define ENETC_BASE_SMCAPR_SM(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_SMCAPR_SM_SHIFT)) & ENETC_BASE_SMCAPR_SM_MASK)
/*! @} */

/*! @name SMHRBDRMR - Switch management host reason 1 receive BD ring mapping register..Switch management host reason 15 receive BD ring mapping register */
/*! @{ */

#define ENETC_BASE_SMHRBDRMR_RXBDR_MASK          (0xFFU)
#define ENETC_BASE_SMHRBDRMR_RXBDR_SHIFT         (0U)
#define ENETC_BASE_SMHRBDRMR_RXBDR_WIDTH         (8U)
#define ENETC_BASE_SMHRBDRMR_RXBDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_SMHRBDRMR_RXBDR_SHIFT)) & ENETC_BASE_SMHRBDRMR_RXBDR_MASK)

#define ENETC_BASE_SMHRBDRMR_EN_MASK             (0x80000000U)
#define ENETC_BASE_SMHRBDRMR_EN_SHIFT            (31U)
#define ENETC_BASE_SMHRBDRMR_EN_WIDTH            (1U)
#define ENETC_BASE_SMHRBDRMR_EN(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_SMHRBDRMR_EN_SHIFT)) & ENETC_BASE_SMHRBDRMR_EN_MASK)
/*! @} */

/*! @name PSIPMAR0 - Port station interface 0 primary MAC address register 0..Port station interface 5 primary MAC address register 0 */
/*! @{ */

#define ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR_MASK   (0xFFFFFFFFU)
#define ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR_SHIFT  (0U)
#define ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR_WIDTH  (32U)
#define ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR_SHIFT)) & ENETC_BASE_PSIPMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PSIPMAR1 - Port station interface 0 primary MAC address register 1..Port station interface 5 primary MAC address register 1 */
/*! @{ */

#define ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR_MASK   (0xFFFFU)
#define ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR_SHIFT  (0U)
#define ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR_WIDTH  (16U)
#define ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR_SHIFT)) & ENETC_BASE_PSIPMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PSIVLANR - Port station interface 0 VLAN register..Port station interface 5 VLAN register */
/*! @{ */

#define ENETC_BASE_PSIVLANR_VID_MASK             (0xFFFU)
#define ENETC_BASE_PSIVLANR_VID_SHIFT            (0U)
#define ENETC_BASE_PSIVLANR_VID_WIDTH            (12U)
#define ENETC_BASE_PSIVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_VID_SHIFT)) & ENETC_BASE_PSIVLANR_VID_MASK)

#define ENETC_BASE_PSIVLANR_DEI_MASK             (0x1000U)
#define ENETC_BASE_PSIVLANR_DEI_SHIFT            (12U)
#define ENETC_BASE_PSIVLANR_DEI_WIDTH            (1U)
#define ENETC_BASE_PSIVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_DEI_SHIFT)) & ENETC_BASE_PSIVLANR_DEI_MASK)

#define ENETC_BASE_PSIVLANR_PCP_MASK             (0xE000U)
#define ENETC_BASE_PSIVLANR_PCP_SHIFT            (13U)
#define ENETC_BASE_PSIVLANR_PCP_WIDTH            (3U)
#define ENETC_BASE_PSIVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_PCP_SHIFT)) & ENETC_BASE_PSIVLANR_PCP_MASK)

#define ENETC_BASE_PSIVLANR_TPID_MASK            (0x30000U)
#define ENETC_BASE_PSIVLANR_TPID_SHIFT           (16U)
#define ENETC_BASE_PSIVLANR_TPID_WIDTH           (2U)
#define ENETC_BASE_PSIVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_TPID_SHIFT)) & ENETC_BASE_PSIVLANR_TPID_MASK)

#define ENETC_BASE_PSIVLANR_TXTAGR_MASK          (0xF00000U)
#define ENETC_BASE_PSIVLANR_TXTAGR_SHIFT         (20U)
#define ENETC_BASE_PSIVLANR_TXTAGR_WIDTH         (4U)
#define ENETC_BASE_PSIVLANR_TXTAGR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_TXTAGR_SHIFT)) & ENETC_BASE_PSIVLANR_TXTAGR_MASK)

#define ENETC_BASE_PSIVLANR_VTEA_MASK            (0x40000000U)
#define ENETC_BASE_PSIVLANR_VTEA_SHIFT           (30U)
#define ENETC_BASE_PSIVLANR_VTEA_WIDTH           (1U)
#define ENETC_BASE_PSIVLANR_VTEA(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_VTEA_SHIFT)) & ENETC_BASE_PSIVLANR_VTEA_MASK)

#define ENETC_BASE_PSIVLANR_E_MASK               (0x80000000U)
#define ENETC_BASE_PSIVLANR_E_SHIFT              (31U)
#define ENETC_BASE_PSIVLANR_E_WIDTH              (1U)
#define ENETC_BASE_PSIVLANR_E(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANR_E_SHIFT)) & ENETC_BASE_PSIVLANR_E_MASK)
/*! @} */

/*! @name PSICFGR0 - Port station interface 0 configuration register 0..Port station interface 5 configuration register 0 */
/*! @{ */

#define ENETC_BASE_PSICFGR0_NUM_TX_BDR_MASK      (0x7FU)
#define ENETC_BASE_PSICFGR0_NUM_TX_BDR_SHIFT     (0U)
#define ENETC_BASE_PSICFGR0_NUM_TX_BDR_WIDTH     (7U)
#define ENETC_BASE_PSICFGR0_NUM_TX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_NUM_TX_BDR_SHIFT)) & ENETC_BASE_PSICFGR0_NUM_TX_BDR_MASK)

#define ENETC_BASE_PSICFGR0_VTIA_MASK            (0x400U)
#define ENETC_BASE_PSICFGR0_VTIA_SHIFT           (10U)
#define ENETC_BASE_PSICFGR0_VTIA_WIDTH           (1U)
#define ENETC_BASE_PSICFGR0_VTIA(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_VTIA_SHIFT)) & ENETC_BASE_PSICFGR0_VTIA_MASK)

#define ENETC_BASE_PSICFGR0_SPE_MASK             (0x800U)
#define ENETC_BASE_PSICFGR0_SPE_SHIFT            (11U)
#define ENETC_BASE_PSICFGR0_SPE_WIDTH            (1U)
#define ENETC_BASE_PSICFGR0_SPE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_SPE_SHIFT)) & ENETC_BASE_PSICFGR0_SPE_MASK)

#define ENETC_BASE_PSICFGR0_VTE_MASK             (0x1000U)
#define ENETC_BASE_PSICFGR0_VTE_SHIFT            (12U)
#define ENETC_BASE_PSICFGR0_VTE_WIDTH            (1U)
#define ENETC_BASE_PSICFGR0_VTE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_VTE_SHIFT)) & ENETC_BASE_PSICFGR0_VTE_MASK)

#define ENETC_BASE_PSICFGR0_VASE_MASK            (0x2000U)
#define ENETC_BASE_PSICFGR0_VASE_SHIFT           (13U)
#define ENETC_BASE_PSICFGR0_VASE_WIDTH           (1U)
#define ENETC_BASE_PSICFGR0_VASE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_VASE_SHIFT)) & ENETC_BASE_PSICFGR0_VASE_MASK)

#define ENETC_BASE_PSICFGR0_SIVIE_MASK           (0x4000U)
#define ENETC_BASE_PSICFGR0_SIVIE_SHIFT          (14U)
#define ENETC_BASE_PSICFGR0_SIVIE_WIDTH          (1U)
#define ENETC_BASE_PSICFGR0_SIVIE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_SIVIE_SHIFT)) & ENETC_BASE_PSICFGR0_SIVIE_MASK)

#define ENETC_BASE_PSICFGR0_ASE_MASK             (0x8000U)
#define ENETC_BASE_PSICFGR0_ASE_SHIFT            (15U)
#define ENETC_BASE_PSICFGR0_ASE_WIDTH            (1U)
#define ENETC_BASE_PSICFGR0_ASE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_ASE_SHIFT)) & ENETC_BASE_PSICFGR0_ASE_MASK)

#define ENETC_BASE_PSICFGR0_NUM_RX_BDR_MASK      (0x7F0000U)
#define ENETC_BASE_PSICFGR0_NUM_RX_BDR_SHIFT     (16U)
#define ENETC_BASE_PSICFGR0_NUM_RX_BDR_WIDTH     (7U)
#define ENETC_BASE_PSICFGR0_NUM_RX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_NUM_RX_BDR_SHIFT)) & ENETC_BASE_PSICFGR0_NUM_RX_BDR_MASK)

#define ENETC_BASE_PSICFGR0_SIVC_MASK            (0xF000000U)
#define ENETC_BASE_PSICFGR0_SIVC_SHIFT           (24U)
#define ENETC_BASE_PSICFGR0_SIVC_WIDTH           (4U)
#define ENETC_BASE_PSICFGR0_SIVC(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_SIVC_SHIFT)) & ENETC_BASE_PSICFGR0_SIVC_MASK)

#define ENETC_BASE_PSICFGR0_SIBW_MASK            (0xF0000000U)
#define ENETC_BASE_PSICFGR0_SIBW_SHIFT           (28U)
#define ENETC_BASE_PSICFGR0_SIBW_WIDTH           (4U)
#define ENETC_BASE_PSICFGR0_SIBW(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR0_SIBW_SHIFT)) & ENETC_BASE_PSICFGR0_SIBW_MASK)
/*! @} */

/*! @name PSICFGR1 - Port station interface 1 configuration register 1..Port station interface 5 configuration register 1 */
/*! @{ */

