zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_PSICFGR1_TC0_MAP_MASK         (0x7U)
#define ENETC_BASE_PSICFGR1_TC0_MAP_SHIFT        (0U)
#define ENETC_BASE_PSICFGR1_TC0_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC0_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC0_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC0_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC1_MAP_MASK         (0x70U)
#define ENETC_BASE_PSICFGR1_TC1_MAP_SHIFT        (4U)
#define ENETC_BASE_PSICFGR1_TC1_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC1_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC1_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC1_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC2_MAP_MASK         (0x700U)
#define ENETC_BASE_PSICFGR1_TC2_MAP_SHIFT        (8U)
#define ENETC_BASE_PSICFGR1_TC2_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC2_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC2_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC2_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC3_MAP_MASK         (0x7000U)
#define ENETC_BASE_PSICFGR1_TC3_MAP_SHIFT        (12U)
#define ENETC_BASE_PSICFGR1_TC3_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC3_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC3_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC3_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC4_MAP_MASK         (0x70000U)
#define ENETC_BASE_PSICFGR1_TC4_MAP_SHIFT        (16U)
#define ENETC_BASE_PSICFGR1_TC4_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC4_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC4_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC4_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC5_MAP_MASK         (0x700000U)
#define ENETC_BASE_PSICFGR1_TC5_MAP_SHIFT        (20U)
#define ENETC_BASE_PSICFGR1_TC5_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC5_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC5_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC5_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC6_MAP_MASK         (0x7000000U)
#define ENETC_BASE_PSICFGR1_TC6_MAP_SHIFT        (24U)
#define ENETC_BASE_PSICFGR1_TC6_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC6_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC6_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC6_MAP_MASK)

#define ENETC_BASE_PSICFGR1_TC7_MAP_MASK         (0x70000000U)
#define ENETC_BASE_PSICFGR1_TC7_MAP_SHIFT        (28U)
#define ENETC_BASE_PSICFGR1_TC7_MAP_WIDTH        (3U)
#define ENETC_BASE_PSICFGR1_TC7_MAP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR1_TC7_MAP_SHIFT)) & ENETC_BASE_PSICFGR1_TC7_MAP_MASK)
/*! @} */

/*! @name PSICFGR2 - Port station interface 0 configuration register 2..Port station interface 5 configuration register 2 */
/*! @{ */

#define ENETC_BASE_PSICFGR2_NUM_MSIX_MASK        (0x3FU)
#define ENETC_BASE_PSICFGR2_NUM_MSIX_SHIFT       (0U)
#define ENETC_BASE_PSICFGR2_NUM_MSIX_WIDTH       (6U)
#define ENETC_BASE_PSICFGR2_NUM_MSIX(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSICFGR2_NUM_MSIX_SHIFT)) & ENETC_BASE_PSICFGR2_NUM_MSIX_MASK)
/*! @} */

/*! @name PSIVMAFCFGR - Port station interface 0 VSI MAC address filtering configuration register..Port station interface 5 VSI MAC address filtering configuration register */
/*! @{ */

#define ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE_MASK (0xFFU)
#define ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE_SHIFT (0U)
#define ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE_WIDTH (8U)
#define ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE_SHIFT)) & ENETC_BASE_PSIVMAFCFGR_NUM_MAC_AFTE_MASK)
/*! @} */

/*! @name PSIVLANFCFGR - Port station interface 0 VLAN filtering configuration register..Port station interface 5 VLAN filtering configuration register */
/*! @{ */

#define ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE_MASK (0xFFU)
#define ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE_SHIFT (0U)
#define ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE_WIDTH (8U)
#define ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE_SHIFT)) & ENETC_BASE_PSIVLANFCFGR_NUM_VLAN_FTE_MASK)
/*! @} */

/*! @name PSIRFSCFGR - Port station interface 0 RFS configuration register..Port station interface 5 RFS configuration register */
/*! @{ */

#define ENETC_BASE_PSIRFSCFGR_NUM_RFS_MASK       (0x1FFU)
#define ENETC_BASE_PSIRFSCFGR_NUM_RFS_SHIFT      (0U)
#define ENETC_BASE_PSIRFSCFGR_NUM_RFS_WIDTH      (9U)
#define ENETC_BASE_PSIRFSCFGR_NUM_RFS(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIRFSCFGR_NUM_RFS_SHIFT)) & ENETC_BASE_PSIRFSCFGR_NUM_RFS_MASK)
/*! @} */

/*! @name PSIUMHFR0 - Port station interface 0 unicast MAC hash filter register 0..Port station interface 5 unicast MAC hash filter register 0 */
/*! @{ */

#define ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW_SHIFT (0U)
#define ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW_WIDTH (32U)
#define ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW_SHIFT)) & ENETC_BASE_PSIUMHFR0_MAC_HASH_FLT_LOW_MASK)
/*! @} */

/*! @name PSIUMHFR1 - Port station interface 0 unicast MAC hash filter register 1..Port station interface 5 unicast MAC hash filter register 1 */
/*! @{ */

#define ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH_SHIFT (0U)
#define ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH_WIDTH (32U)
#define ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH_SHIFT)) & ENETC_BASE_PSIUMHFR1_MAC_HASH_FLT_HIGH_MASK)
/*! @} */

/*! @name PSIMMHFR0 - Port station interface 0 multicast MAC hash filter register 0..Port station interface 5 multicast MAC hash filter register 0 */
/*! @{ */

#define ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW_SHIFT (0U)
#define ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW_WIDTH (32U)
#define ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW_SHIFT)) & ENETC_BASE_PSIMMHFR0_MAC_HASH_FLT_LOW_MASK)
/*! @} */

/*! @name PSIMMHFR1 - Port station interface 0 multicast MAC hash filter register 1..Port station interface 5 multicast MAC hash filter register 1 */
/*! @{ */

