zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_BASE.h
#define ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH_SHIFT (0U)
#define ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH_WIDTH (32U)
#define ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH_SHIFT)) & ENETC_BASE_PSIMMHFR1_MAC_HASH_FLT_HIGH_MASK)
/*! @} */

/*! @name PSIVHFR0 - Port station interface 0 VLAN hash filter register 0..Port station interface 5 VLAN hash filter register 0 */
/*! @{ */

#define ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW_SHIFT (0U)
#define ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW_WIDTH (32U)
#define ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW_SHIFT)) & ENETC_BASE_PSIVHFR0_VLAN_HASH_FLT_LOW_MASK)
/*! @} */

/*! @name PSIVHFR1 - Port station interface 0 VLAN hash filter register 1..Port station interface 5 VLAN hash filter register 1 */
/*! @{ */

#define ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH_MASK (0xFFFFFFFFU)
#define ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH_SHIFT (0U)
#define ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH_WIDTH (32U)
#define ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH_SHIFT)) & ENETC_BASE_PSIVHFR1_VLAN_HASH_FLT_HIGH_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_BASE_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_BASE_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_BASE_H_) */
